cloud/kubernetes/operator.org.html
<!DOCTYPE html>
<html>
  <head>
    <meta charset="utf8"></meta>
    <title>operator.org</title>
    <link rel="stylesheet" href="/diary/resources/css/main.css" />
    <link rel="stylesheet" href="/diary/resources/highlight/styles/default.css" />
  </head>
  <body>
    <section class="main-article-area">
      <nav id='content'>
	<span id="prev">
	  	
	  <a href="/diary/cloud/kubernetes/kubernetes-guide.org.html">Prev: kubernetes-guide.org</a>
	  	
	</span>

	<span id="home"><a href="/diary">Home</a></span>
	<span id="Up">
	  
	  <a href="/diary/cloud/kubernetes">Up: kubernetes</a>
	  	
	</span>

	<span id="next">
	  
	  <a href="/diary/cloud/kubernetes/rbac.org.html">Next: rbac.org</a>
	  	
	</span>
      </nav>
      
      <div id='main'>
	<h1 id="basic">Basic</h1>
<h2 id="definition">Definition</h2>
<p>Operator extents kubernetes API to manage complex stateful components.</p>
<h2 id="custom-resouse-controller">Custom Resouse + Controller</h2>
<h2 id="reconcile-status-and-specification">Reconcile status and specification</h2>
<ol class="incremental">
<li>Observe (get status)</li>
<li>Analyze (compare status with specification)</li>
<li>Act (update status)</li>
</ol>
<h2 id="opetaor-vs-k8s-controller"><span class="todo TODO">TODO</span> Opetaor vs k8s controller</h2>
<h3 id="code-generate"><span class="todo TODO">TODO</span> code generate</h3>
<h1 id="sample">Sample</h1>
<h2 id="etcd-operator">etcd Operator</h2>
<ul class="incremental">
<li><a href="https://coreos.com/operators/etcd/latest/deployment.yaml">https://coreos.com/operators/etcd/latest/deployment.yaml</a></li>
<li><a href="https://github.com/coreos/etcd-operator">https://github.com/coreos/etcd-operator</a></li>
</ul>
<h2 id="prometheus-operator">prometheus-operator</h2>
<ul class="incremental">
<li><a href="https://github.com/coreos/prometheus-operator">https://github.com/coreos/prometheus-operator</a></li>
</ul>

      </div>
    </section>
  </body>
</html>
